In [1]:
import numpy as np
import pandas as pd

In [6]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['aaa','bbb','ccc','ddd']})
df

   col1  col2 col3
0     1   444  aaa
1     2   555  bbb
2     3   666  ccc
3     4   444  ddd

In [7]:
#Finding unique values in a column

df['col2'].unique()

array([444, 555, 666])

In [8]:
#Finding the number of unique values in a column

df['col2'].nunique()

3

In [12]:
#Counting the occurence of unique values in tha table

df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Applying custom Function

In [13]:
def times2(x):
    return x*2

In [17]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
#Using lambda expression (saves time of creating a function !)

df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [20]:
df.isnull()  #Gives if the value is null or not in the table

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

# Data Input and Output

In [21]:
import pandas as pd

In [22]:
pd.read_csv('example')  #csv file must be present in the same folder

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
df = pd.read_csv('example')  #Reading CSV
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
df.to_csv("MyOutput",index=False) #Saving the data to a file
pd.read_csv('MyOutput')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [31]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')  #Reading Excel

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
df.to_excel('Excel_Sample2.xlsx',sheet_name="Sheet2")

In [ ]:
#WEB SCRAPING

pd.read_html('http://www.contextures.com/SampleData.zip')  #Read HTML with tables

#We can use HTML tage like head() , table() etc to find the data inside it

In [43]:
from sqlalchemy import create_engine   #Creating a sql table
engine=create_engine('sqlite:///:memory:')
df.to_sql('my_table',engine)

In [44]:
sqldf=pd.read_sql('my_table',con=engine)  #Reading the sql table created
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15